public/posts/cycling-incident.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-20 Wed 12:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cycling incident</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li> <a href="/index.html">Home</a> </li>
  <li> <a href="/contact.html">Contact</a> </li>
  <li> <a href="/resume.html">Résumé</a> </li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Cycling incident</h1>
</header><p>
Just today, I went cycling, something I've been meaning to do for a
really long time.
</p>

<p>
Between university, personal projects, hobbies and relationships, it's
really hard to fit in a time to cycle to clear my mind and head right
through the wind, smelling cold fresh air at high speeds.
</p>

<p>
The ride was butter smooth, it brought back all the lovely memories
and I was truly enjoying myself.
</p>

<p>
As I was returning home, I thought it'd be a good idea to stop by
the gas station and pump the tires - they felt a little too
light, but this turned out to be a huge mistake.
</p>

<p>
Whilst pumping the front tire, I noticed that it wasn't getting any
stiffer&#x2026; In fact, it was deflating. Turns out the valves are too
small for the garbage air pump they have installed.
</p>

<p>
Long story short, I had to walk back home like an idiot, while the
tire was squeaking the entire way back.
</p>
</div>
</body>
</html>
